SSR = ["里見 灯花","アリナ・グレイ","水波 レナ","呉 キリカ","巴 マミ","十咎 ももこ","鹿目 まどか","五十鈴 れん","佐倉 杏子","静海 このは","御園 かりん","粟根 こころ","天音 月夜","美樹 さやか","相野 みと","梢 麻友","眞尾 ひみか","八雲 みたま","雪野 かなえ","梓 みふゆ","和泉 十七夜","千秋 理子","牧野 郁美","柊 ねむ","環 うい","更紗 帆奈"]
SR = ["秋野 かえで","竜宮 明日香","常盤 ななか","阿見 莉愛","純 美雨","伊吹 れいら","毬子 あやか","江利 あいみ","遊佐 葉月","加賀見 まさら","綾野 梨花","安名 メル","観鳥 令","美国 織莉子","千歳 ゆま"]
NR = ["七海 やちよ","由比 鶴乃","二葉 さな","深月 フェリシア","矢宵 かのこ","空穂 夏希","都 ひなの","美凪 ささら","木崎 衣美理","保澄 雫","志伸 あきら","夏目 かこ","春名 このみ"]
SSR_memoria = ["迷わないこの道","過去と未来","光の指す方へ！","灯し続ける明かり","果たすと誓った約束","勝利の紅茶","君と、ここで","曲げない信念","頼れるネゴシエーター","友達できた！","再起と決意","マイバイブル","終わらない稽古","大切な人のために","芸術への姿勢","団地に差し込む日差し","真剣な顔だって出来ますよ？","スターライトパワー！","生まれながらのわたしは…","竜真流師範代","穏やかな風","自責に包まれて","超えられない溝","この世界で生きていく","大切な人を守る力","みんな可愛く彩って","ラブキュンなメイドさん","休憩時間は何味？＜灯花＞","彼方への憧れ","時化た枯れ地に安寧を","お節介なタイミング","大嫌いな人が好きな人","自然から力をもらって","願いで満ちた世界だから","どんなわたしになるのかな？","たとえ道を間違えても","背中を合わせて","アイドルで魔法少女だから","朝焼けに発つ"]
SR_memoria = ["きっと喜んでくれるよね","As a fashion model","バスケットボールでも最強","待ってたわけじゃないから","PPPH！コールは完璧！","白い翼に囲まれて","静淑なる朝稽古","初対面コンビネーション！","一緒に食べよ","息のあったコンビネーション！","Begin a Hunt","みんなには内緒だよ！","メガネでガールズデート","まどかと因果を紡ぐ魔法少女","Splash party！","夢と希望を抱いて！","地下水路の手荒い歓迎","興奮冷めて晴天","雨上がりの帰り道＜れいら＞","美術館でアルバイト","眞尾家は今日もにぎやか","雫の旅の目的地は！？","全ての視線は私のもの","今は二人で見守って","一翼を担う理由","なぎたんにお任せ","工匠区の人気者","スクープは逃さない","休憩時間は何味？＜アリナ＞","休憩時間は何味？＜ねむ＞","Three geniuses","待ち人","休日は美術館へ"]
NR_memoria = ["少女の境界","穏やかな日差し","寄り添い見守る心","時間遡行者","ぬいぐるみじゃないよね","頼れるマミ先輩！","ちょっと一口！","一筋の希望を探して","後悔だけはしない","Different Story:Rookies","Different Story:マミと杏子","世界へのランウェイ","君のそばにいるよ！","サイエンスドランカー","放課後は大忙し！","花と心","あーしの靴でしょ！","彼の地は遥か遠く…","ラブリーあきらルーム","未来の三ツ星シェフ","至福の世界","心解ける枕","渾身の一発ギャグ","空虚だった世界","ブーケに込められた思い","これが恋の香り","苦い紅茶にはお砂糖を","無限の喜びをきみに","ぶっきらぼうな救世主","絶望を希望に","終末の向こうへ","休日の昼寝も思うがまま","あたしの学校生活","三人でお茶を","視線の先にあるものは…","サカサマのあちし！","日々妄想","放課後の透明少女","2人の共同戦線","なんでもない日","雨上がりの帰り道＜せいか＞","東西の緊張","継承される絆","残照"]

10.times do
    gacha = rand(100)
        if gacha <= 53
            puts "★2[メモリア]"+NR_memoria.sample
        elsif gacha >= 54 && gacha <= 79
            puts "★2"+NR.sample
        elsif gacha >= 80 && gacha <= 92
            puts "★3[メモリア]"+SR_memoria.sample
        elsif gacha >= 93 && gacha <= 96
            puts "★4[メモリア]"+SSR_memoria.sample
        elsif gacha >= 97 && gacha <= 99
            puts "★3"+SR.sample
        else
            puts "★4"+SSR.sample
        end
end
